const kaomojis = {
  // Positive Emotions
  joy: [
    "(^_^)",
    "(*≧ω≦)",
    "(´꒳`)",
    "(✧∀✧)/",
    "(*^‿^*)",
    "(๑>ᴗ<๑)",
    "(๑˃ᴗ˂)ﻭ",
    "ヽ(・∀・)ﾉ",
    "(´｡• ᵕ •｡`)",
    "☆*:.｡.o(≧▽≦)o.｡.:*☆",
  ],

  love: [
    "(♥ω♥*)",
    "(*♡∀♡)",
    "(ღ˘⌣˘ღ)",
    "（♥￫ｏ￩♥）",
    "♡(˃͈ દ ˂͈ ༶ )",
    "(｡♥‿♥｡)",
    "(๑♡⌓♡๑)",
    "(◍•ᴗ•◍)❤",
    "(●♡∀♡)",
    "(✿ ♡‿♡)",
  ],

  embarrassment: [
    "(⁄ ⁄•⁄ω⁄•⁄ ⁄)",
    "(⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄)",
    "(⸝⸝⸝°⁻̫° ⸝⸝⸝)",
    "(*ﾉωﾉ)",
    "(o////o)",
    "(#｀ε´#ゞ",
    "(#^.^#)",
    "٩(//̀Д/́/)۶",
    "(/ω＼)",
    "(⸝⸝>_<⸝⸝)",
  ],

  sympathy: [
    "(っ˘̩╭╮˘̩)っ",
    "(｡•́︿•̀｡)",
    "(*´I`)",
    "(/□＼*)・゜",
    "(｡╯︵╰｡)",
    "(ノ_<。)ヾ(´ ▽ ` )",
    "ρ(- ω -、)ヾ(￣ω￣; )",
    "ヽ(´ー｀)ノ ヽ(´ー｀)ノ",
    "(っ´ω`)ﾉ(╥ω╥)",
  ],

  // Negative Emotions
  dissatisfaction: [
    "(¬_¬)",
    "(￢_￢)",
    "╮(￣_￣)╭",
    "ヽ( `д´*)ノ",
    "(－‸ლ)",
    "(눈_눈)",
    "(¬▂¬)",
    "(c'mon)",
    "＼(〇_ｏ)／",
    "(＃￣0￣)",
  ],

  anger: [
    "(╬ಠ益ಠ)",
    "ヽ(≧Д≦)ノ",
    "୧(๑•̀ㅁ•́๑)૭",
    "( `ε´ )",
    "(*≧m≦*)",
    "ヽ(#`Д´)ﾉ",
    "(*￣m￣)",
    "( ╬◣ 益◢)",
    "ヾ(。◣∀◢。)ﾉ",
    "o(-`д´- ｡)",
  ],

  sadness: [
    "(╥_╥)",
    "(T_T)",
    "(ಥ﹏ಥ)",
    "｡･ﾟﾟ*(>д<)*ﾟﾟ･｡",
    "(。╯︵╰。)",
    "｡ﾟ(ﾟ´Д｀ﾟ)ﾟ｡",
    "๐·°(৹˃̵﹏˂̵৹)°·๐",
    "(个_个)",
    "(╯︵╰,)",
    "(╥﹏╥)",
  ],

  pain: [
    "☆⌒(＞。≪)",
    "(x_x)",
    "(*>_<*)ﾉ",
    "(>.<)",
    "～(＞＜)～",
    "(*_*)",
    "(×_×;）",
    "( ͡° ʖ̯ ͡°)",
    "(ᗒᗩᗕ)",
  ],

  fear: [
    "(ノωヽ)",
    "(⊃д⊂)",
    "(o_O)",
    "ヽ(ﾟДﾟ)ﾉ",
    "(((φ(◎ロ◎;)φ)))",
    "{{|└(>o< )┘|}}",
    "＼(º □ º l|l)/",
    "(/;◇;)/",
    "（ΩДΩ）",
    "ミ●﹏☉ミ",
  ],

  // Neutral Emotions
  indifference: [
    "ヽ(ー_ー )ノ",
    "┐('～`;)┌",
    "ヽ( ´¬`)ノ",
    "¯\\_(ツ)_/¯",
    "ヽ(ಠ_ಠ)ノ",
    "(ー_ー)!!",
    "〜(￣▽￣〜)",
    "┐(￣ヘ￣)┌",
    "ᕕ( ᐛ )ᕗ",
    "╮ (. ❛ ᴗ ❛.) ╭",
  ],

  confusion: [
    "(￣ω￣;)",
    "(⊙_☉)",
    "(゜-゜)",
    "ヽ(°〇°)ﾉ",
    "( •́ .̫ •̀ )",
    "(・_・ヾ",
    "(・・。)ゞ",
    "↷( ó╻ò)",
    "￢(￢ )ﾍ",
    "「(°ヘ°)",
  ],

  doubt: [
    "(￢_￢)",
    "(→_→)",
    "(￣_￣|||)",
    "(-_-?)",
    "(。ヘ°)",
    "(ーー;)",
    "(^～^;)ゞ",
    "ヽ(゜Q。)ノ？",
    "(」゜ロ゜)」",
    "(Ծ‸ Ծ)",
  ],

  surprise: [
    "(°o°)",
    "(⊙_⊙)",
    "( ﾟoﾟ)",
    "Σ(゜゜)",
    "o(〒﹏〒)o",
    "(ﾟﾛﾟ)",
    "Σ(๑０ω０๑)",
    "(•ิ_•ิ)?",
    "(*0*;)",
    "(□_□)",
  ],

  // Various Actions
  greeting: [
    "ヾ(＾-＾)ノ",
    "( ´ ▽ ` )ﾉ",
    "(*・ω・)ﾉ",
    "(ノ^_^)ノ",
    "ヾ(•ω•`)o",
    "(*^▽^)/★*☆♪",
    "(￣▽￣)ノ",
    "╰(＾3＾)╯",
    "ヾ(・ω・*)",
    "＼(￣O￣)",
  ],

  hugging: [
    "(づ￣ ³￣)づ",
    "ლ(・ヮ・ლ)",
    "⊂(◉‿◉)つ",
    "(つ≧▽≦)つ",
    "(つ✧ω✧)つ",
    "(⊃｡•́‿•̀｡)⊃",
    "(っಠ‿ಠ)っ",
    "໒( • ͜ʖ • )७",
    "(つ◉益◉)つ",
    "(.づσ▿σ)づ",
  ],

  winking: [
    "(^_~)",
    "(*^ー^)",
    "（＾＿－）",
    "(^_<)〜☆",
    "(;^_~)",
    "(^.~)☆",
    "(^ω~)",
    "(>ω^)",
    "(~人^)",
    "(^_-)≡☆",
  ],

  apologizing: [
    "m(_ _)m",
    "(シ_ _)シ",
    "ごめんなさい(._.)",
    "(〒︿〒)",
    "ｍ（．＿．）ｍ",
    "（ﾉ´д｀）",
    "(シ. .)シ",
    "_(_^_)_",
    "<(_ _)>",
    "人(_ _*)",
  ],

  hiding: [
    "|_・)",
    "｜_・）",
    "┬┴┬┴┤(･_├┬┴┬┴",
    "┬┴┬┴┤(･_├┬┴┬┴",
    "(ノω<。)ノ))☆.。",
    "|ω・）",
    "(/ω＼)",
    "(/_・)ノ",
    "|ω･)و ̑̑༉",
    "|_-)",
  ],

  writing: [
    "__φ(。。)",
    "___φ(°-°=)",
    "___〆(・∀・)",
    "__φ(．．)",
    "___ψ(°-°=)",
    "__φ(-ω-)",
    "__〆(￣ー￣)",
    "__φ(^∇^)",
    "__ψ(。。)",
  ],

  running: [
    "ε=ε=ε=┌(;￣▽￣)┘",
    "ε=ε=ε=ε=┏(゜ロ゜;)┛",
    "ヾ(￣▽￣)ノ",
    "C= C= C= C=┌(;・ω・)┘",
    "┌(˘⌣˘)ʃ",
    "ヽ(￣д￣;)ノ=3=3",
    "。。。(((((º∀º)屮",
    "!(;ﾟoﾟ)ｏ=3=3=3",
    "~==三 ε=ε=ε=(ﾉﾟдﾟ)ﾉ",
    "ε=ε=ε=(ﾉ*´▽｀*)ﾉ",
  ],

  sleeping: [
    "(∪｡∪)｡｡｡zzz",
    "(-.-)Zzz...",
    "(￣o￣) zzZZzzZZ",
    "(ᴗ˳ᴗ)",
    "(-_-) zzz",
    "[(－－)]..zzz",
    "(∪｡∪)..zzz",
    "(´-ω-｀)zzz...",
    "(○ ´Ｏ｀)ﾉ.｡ｏ○○ｏ｡.ﾉｏ○",
    "(＿ ＿*) Z z z",
  ],

  //Animals
  cat: [
    "ฅ^•ﻌ•^ฅ",
    "(=^･ω･^=)",
    "(=^･ｪ･^=)",
    "(=①ω①=)",
    "ฅ(＾・ω・＾ฅ)",
    "ฅ(ΦωΦ)ฅ",
    "(=ＴェＴ=)",
    "(=ｘェｘ=)",
    "（=´∇｀=）",
    "(=^･^=)",
    "(=；ェ；=)",
    "(=｀ω´=)",
    "(=｀ェ´=)",
    "（＾・ω・＾✿）",
    "(^-人-^)",
    "(=ΦｴΦ=)",
    "(=^‥^=)",
    "ฅ•ω•ฅ",
    "ฅ(≚ᄌ≚)",
    "ฅ(•ㅅ•❀)ฅ",
    "ฅ(^ω^ฅ)",
    "ฅ(ﾐ・ᆽ・ﾐ)ฅ",
    "ฅ(ﾐΦ ﻌ Φﾐ)∗",
    "ฅ(• ɪ •)ฅ",
    "ฅ(＾・ω・＾ฅ)",
    "ฅ(º ﻌ ºฅ)",
    "ฅʕ•ᴥ•ʔฅ",
    "ฅ(ﾐ꒡ᆽ꒡ﾐ)ฅ✧",
    "ฅ(ﾐ>ᆽ<ﾐ)∫",
    "ฅ(ﾐ˘ᆽ˘ﾐ)∫",
    "ฅ(ﾐ´ω`ﾐ)ฅ",
    "ฅ(ﾐゝᆽ╹ﾐ)∫",
  ],

  bear: [
    "ʕ•ᴥ•ʔ",
    "ʕっ•ᴥ•ʔっ",
    "ʕºᴥºʔ",
    "ʕ•́ᴥ•̀ʔっ",
    "ʕᴥ• ʔ",
    "ʕ•ᴥ•ʔノ",
    "ʕ º ᴥ ºʔ",
    "ʕ•̫͡•ʔ",
    "ʕ￫ᴥ￩ʔ",
    "ʕ•ᴥ•ʔゝ☆",
    "ʕ ´•ᴥ•`ʔ",
    "ʕ•̫͡•ིʔྀ",
    "ʕ·ᴥ·ʔ",
    "ʕᴥ·ʔ",
    "ʕʘᴥʘʔ",
    "ʕง•ᴥ•ʔง",
    "ʕ•̼͛͡•ʕ-̺͛͡•ʔ•̮͛͡•ʔ",
    "ʕ༼◕ ౪ ◕✿ʔ",
    "ʕʽɞʼʔ",
    "ʕ•̀ω•́ʔ✧",
    "ʕง ͠° ͟ل͜ ͡°ʔง",
    "ʕ*ﾉᴥﾉʔ",
    "ʕಠᴥಠʔ",
    "ʕ◉ᴥ◉ʔ",
    "ʕᵔᴥᵔʔ",
    "ʕ>ᴥ<ʔ",
    "ʕʘ̅͜ʘ̅ʔ",
    "ʕ´•ᴥ•`ʔ",
  ],

  dog: [
    "∪･ω･∪",
    "∪＾ェ＾∪",
    "∪･ｪ･∪",
    "ヾ(｡･ω･｡)",
    "(●｀･(ｴ)･´●)",
    "Σ>―(〃°ω°〃)♡→",
    "U ´꓃ ` U",
    "(〓￣(∵エ∵)￣〓)",
    "U・♀・U",
    "(U・x・U)",
    "▼・ᴥ・▼",
    "V●ᴥ●V",
    "ฅ^•ﻌ•^ฅ",
    "U ´･ᴥ･` U",
    "(❍ᴥ❍ʋ)",
    "└(°ᴥ°)┘",
    "U^ｪ^U",
    "ｖ・。・Ｖ",
    "U^皿^U",
    "U･ᴥ･U",
    "(U・ᴥ・U)",
    "U｡･ｪ･｡U",
    "▼(´ᴥ`)▼",
    "Uo･ｪ･oU",
    "U ˒˒",
    "∪￣ᴥ￣∪",
    "∪･ω･∪",
    "Uo‿･ｪ･‿oU",
    "ｏ（Ｕ・ω・）⊃",
  ],

  rabbit: [
    // Rabbit kaomojis
    "(/･ω･(-ω-)",
    "／(^ x ^=)＼",
    "／(^ x ^)＼",
    "／(･ × ･)＼",
    "／(=∩_∩=)＼",
    "／(v x v｡)人(｡v x v)＼",
    "／(=･ x ･=)＼",
    "／(^･ｪ･^)＼",
    "／(=⌒x⌒=)＼",
    "／(v x v)＼",
    "／(=´x`=)＼",
    "／(v x v｡)＼",
    "／(=✪ x ✪=)＼",
    "／(･ x ･)＼",
    "／(^･ω･^)＼",
    "／(｡v x v｡)＼",
    "／(=^･ｪ･^=)＼",
    "／(=^･ω･^=)＼",
    "／(=´x`=)＼",
  ],

  panda: [
    // Panda kaomojis
    "ヽ(￣(ｴ)￣)ﾉ",
    "( ´(ｴ)｀)",
    "(￣(エ)￣)",
    "ヾ(￣(エ)￣ヾ)",
    "(／(ｴ)＼)",
    "（´(ｪ)｀）",
    "(o(￣(ｴ)￣)o)",
    "ヾ(´(ｴ)｀ﾉﾞ",
    "ヽ(￣(ｴ)￣)ﾉ",
    "(๑￣(ｴ)￣๑)",
    "(／￣(ｴ)￣)／",
    "(/-(ｴ)-＼)",
    "(¬(ｴ)¬)",
    "ヾ(´(ｴ)｀ﾉﾞ",
    "(〇(ｴ)〇)",
    "(´(ｪ)｀)",
    "(￣(ｴ)￣)ﾉ",
    "(／￣(ｴ)￣)／",
    "(¬‿¬)",
    "（〃・(ｴ)・〃）",
    "(つ-(ｴ)-)つ",
    "(･(ｴ)･｡)",
    "(つ￣(ｴ)￣)つ",
    "(≧(ｴ)≦ )",
    "(o-(ｴ)-o)",
    "(*￣(ｴ)￣*)",
  ],

  owl: [
    "(๑•o•๑)",
    "▼o・ェ・o▼",
    "(o･(ェ)･o)",
    "＠・＊・＠",
    "▼・ᴥ・▼",
    "(o(エ)o)",
    "(￣(エ)￣)",
    "(Φ(エ)Φ)",
    "(ΦзΦ)",
    "▼(エ)▼",
    "(o(ｪ)o)",
    "(Φ(ｪ)Φ)",
    "(￣(ｴ)￣)ﾉ",
    "(ΦωΦ)",
    "(o(ｪ)o)",
    "(๑Φ(エ)Φ๑)",
    "(ΦωΦσ)σ",
    "(ΦзΦ)",
    "(ΦεΦ)",
    "(ﾐ○ﻌ○ﾐ)",
    "(ꀄꀾꀄ)",
    "(❛ӧ❛三❛ӧ❛)",
    "(◉Θ◉)",
    "(]ΦωΦ[)",
    "(oΦｴΦo)",
    "(   ⊙ Θ ⊙)",
    "(ㅇㅅㅇ❀)",
    "(oΦﻌΦo)",
    "(*ΦωΦ)ゞ",
    "(✪㉨✪)",
    ],

  elephant: [
    "(¬(エ)¬)",
    "(っ・(エ)・)っ",
    "(￣(エ)￣)",
    "(◕(エ)◕)",
    "ʕ •(エ)•ʔ",
    "ʕ ·(エ)·ʔ",
    "ʕ ￫(エ)￩ ʔ",
    "(◉(エ)◉)",
    "ʕ•̫͡ •ʔ",
    "ʕ ˵ •(エ)• ˵ ʔ",
    "ʢ◉ᴥ(エ)ʡ",
    "ʕ ·͡ˑ·ཻʔ",
    "ʕ•̫͡(エ) •ʔ",
    "ʕ•(エ)•ʔﾉ",
    "ʕっ•(エ)•ʔっ",
    "ʕ ·ᴥ·ʔ",
    "ʕ•(エ) •ʔ",
    "ʕ ฅ•(エ)•ฅʔ",
    ],

  fox: [
    "(๑ↀᆺↀ๑)✧", 
    "๏◡๏",
    "ᘛᵒᴥᵒᘚ",
    "ᘛ⁐̤ᕐᐷ",
    "(●...●)",
    "ᕮ╹ヮ╹ᕭ",
    "ᕳ˵•ﻌ•˵ᕲ",
    "✧/ᐠ-ꞈ-ᐟ",
    "(＾ᵔᴥᵔ＾)",
    "⁽˙³˙⁾◟(˘•ω•˘)◞⁽˙³˙",
    "ᶘ ͡°ᴥ͡°ᶅ",
    "ˁ˙͠˟˙ˀ",
    "( ͒ ु•·̫• ू ͒)",
  ],

  mouse: [
    // Mouse kaomojis
    "ʢ◉ᴥ◉ʡ",
    "(•ิ_•ิ)/",
    "ᘛᵒᴥᵒᘚ",
    "(=⌒‿‿⌒=)",
    "(=⌒‿‿⌒=)",
  ],

  pig: ["( ´(00)ˋ )", "(=｀(∞)´=)", "(´(00)ˋ)", "ʕ•͡(oo)•͡ʔ", "ʕ•͡(oo)•͡ʔ"],

  duck: ["( •ө• )", "(._.)", "(•ө•)♡", "ㄟ( ･ө･ )ㄏ", "꜀( ˊ̠˂˃ˋ̠ )꜆"],

  monkey: [
    "@(o･ｪ･o)@",
    "⊂((・⊥・))⊃",
    "⊂(ο･㉨･ο)⊃",
    "⊂(･ω･*⊂)",
    "⊂(・(ェ)・)⊃",
  ],

  sheep: ["ᏊˊꈊˋᏊ", "Ꮚ˘̩̩̩ꍓ˘̩̩̩Ꮚ", "ᏊˊꍓˋᏊ", "ᏊᵔꈊᵔᏊ", "Ꮚˊ̥̥̥̥̥̥ꈊˋ̥̥̥̥̥̥Ꮚ"],
};

function displayKaomojis(type) {
  const kaomojiDisplay = document.getElementById("kaomoji-display");
  const categoryButtons = document.querySelectorAll(".button-container button");

  // Update active state for category buttons
  categoryButtons.forEach((button) => {
    if (button.getAttribute("data-type") === type) {
      button.classList.add("active");
    } else {
      button.classList.remove("active");
    }
  });

  if (kaomojis[type]) {
    // Create kaomoji buttons with initial opacity set to 0
    const buttonsHtml = kaomojis[type]
      .map(
        (kaomoji) =>
          `<button class="kaomoji-button" style="opacity:0;" onclick="copyKaomojiToClipboard('${kaomoji}')">${kaomoji}</button>`
      )
      .join(" ");

    // Set inner HTML
    kaomojiDisplay.innerHTML = buttonsHtml;

    // Calculate the max width
    let maxWidth = 0;
    const kaomojiButtons =
      kaomojiDisplay.getElementsByClassName("kaomoji-button");
    for (const button of kaomojiButtons) {
      if (button.offsetWidth > maxWidth) {
        maxWidth = button.offsetWidth;
      }
    }

    // Apply max width to all buttons and make them visible
    for (const button of kaomojiButtons) {
      button.style.minWidth = `${maxWidth}px`;
      button.style.opacity = "1";
    }
  } else {
    kaomojiDisplay.innerText = "No kaomojis found for this category";
  }
}

function copyKaomojiToClipboard(kaomoji) {
  navigator.clipboard
    .writeText(kaomoji)
    .then(() => {
      // Show snackbar
      const snackbar = document.getElementById("snackbar");
      snackbar.className = "show";
      snackbar.innerText = `${kaomoji} copied to clipboard`;
      setTimeout(
        () => (snackbar.className = snackbar.className.replace("show", "")),
        3000
      );
    })
    .catch((err) => {
      console.error("Error copying kaomoji to clipboard:", err);
    });
}
